<?php

class Users
{
	const CITIES = [
		'Смоленск', 'Москва', 'Владивосток', 'Десногорск', 'Нурсултан', 'Самара', 'Тольяти', 'Киев', 'Багдад', 'Оргриммар',
		'Новосибирск', 'Ангарск', 'Братск', 'Брянск', 'Калуга', 'Ривия','Вызима', 'Новиград', 'Блавикен', 'Цинтра',
		'Оксенфурт', 'Каэр Трольде', 'Каэр Морхен', 'Вергенберг',
	];

	const NAMES = [
		'Данил', 'Геральт', 'Павел', 'Цирилла', 'Владимир', 'Эдуард', 'Анастасия', 'Йеннифэр', 'Трисс', 'Лютик', 'Станислав',
		'Георгий', 'Дмитрий', 'Наталья', 'Ольга', 'Кирилл', 'Толик', 'Аристарх', 'Вельзевул', 'Велиар', 'Руслан', 'Игорь',
	];

	public static function getRandomData(): array
	{
		$data = [];
		for($i = 0; $i < 10; $i++) {
			$data[] = [
				'name' => self::NAMES[random_int(0, count(self::NAMES)-1)],
				'city' => self::CITIES[random_int(0, count(self::CITIES)-1)],
				'age' => random_int(0, 100),
			];
		}

		return $data;
	}
}


